In [1]:
import pandas as pd
import numpy as np
import statistics as st
import seaborn as sns
import matplotlib.pyplot as plt
from scipy import stats

In [21]:
mydata=pd.read_excel ("../data/penguins.xlsx")

In [22]:
mydata.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,NaN,2007
2,Adelie,Torgersen,40.3,18.0,195.0,NaN,female,2007
3,Adelie,NaN,36.7,19.3,193.0,3450.0,female,2007
4,Adelie,Torgersen,39.3,20.6,NaN,3650.0,NaN,2007

In [23]:
mydata.drop(columns=['year'], inplace=True)

In [24]:
mydata.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,NaN
2,Adelie,Torgersen,40.3,18.0,195.0,NaN,female
3,Adelie,NaN,36.7,19.3,193.0,3450.0,female
4,Adelie,Torgersen,39.3,20.6,NaN,3650.0,NaN

In [25]:
mydata = mydata.loc[mydata['flipper_length_mm'] >= 176]

In [26]:
mydata.isna().sum()

species              25
island               29
bill_length_mm       18
bill_depth_mm        16
flipper_length_mm     0
body_mass_g          41
sex                  49
dtype: int64

In [27]:
categorical_columns=["species", "island", "sex"]
mydata[categorical_columns]=mydata[categorical_columns].fillna("Unknown")

In [18]:
mydata.isna().sum()

species               0
island                0
bill_length_mm       18
bill_depth_mm        16
flipper_length_mm     0
body_mass_g          41
sex                   0
dtype: int64

In [19]:
mydata.fillna(mydata.mean(numeric_only=True).round(1), inplace=True)

In [29]:
mydata['bill_length_mm']=mydata['bill_length_mm'].fillna(mydata.groupby('species')['bill_length_mm'].transform('mean'))
mydata['bill_depth_mm']=mydata['bill_depth_mm'].fillna(mydata.groupby('species')['bill_depth_mm'].transform('mean'))
mydata['body_mass_g']=mydata['body_mass_g'].fillna(mydata.groupby('species')['body_mass_g'].transform('mean'))

In [30]:
mydata.isna().sum()

species              0
island               0
bill_length_mm       0
bill_depth_mm        0
flipper_length_mm    0
body_mass_g          0
sex                  0
dtype: int64

In [32]:
mydata.to_excel('C:\\Users\\mmaha\\Documents\\cisa5320\\data\\cleaned_penguin.xlsx',index=False)